function question1() {
    let quest = prompt("Выработка, транспортировка и потребление электроэнергии, электроприборы высокой мощности (например электродвигатель, электростанция), электрическая система отопления, линия электропередачи.")=="Энергетика"?alert("Верно"):alert("Неверно")
}
function question2() {
    let quest = prompt("Электронные устройства, в которых в качестве активных элементов используются микросхемы.")=="Микроэлектроника"?alert("Верно"):alert("Неверно")
}
function question3() {
    let quest = prompt("Устройства в которых используются электрический ток и потоки фотонов.")=="Оптоэлектроника"?alert("Верно"):alert("Неверно")
}
function question4() {
    let quest = prompt("Устройства усиления и преобразования звука и видео изображений.")=="Аудио-видеотехника"?alert("Верно"):alert("Неверно")
}
function question5() {
    let quest = prompt("Устройства на микропроцессорах или логических микросхемах. Например: электронный калькулятор, компьютер, цифровой телевизор, мобильный телефон, принтер, робот, панель управления промышленным оборудованием, средствами транспорта, и другие бытовые и промышленные устройства.")=="цифровая микроэлектроника"?alert("Верно"):alert("Неверно")
}
function question10() {
    let quest = prompt("Что может включать в себя электронное устройство.")=="Разные материалы и среды"?alert("Верно"):alert("Неверно")
}
function question11() {
    let quest = prompt("Проводник с односторонней проводимостью от анода к катоду.")=="Диод"?alert("Верно"):alert("Неверно")
}
function question12() {
    let quest = prompt("Раздел астрономии, использующий принципы физики и химии, который изучает физические процессы в астрономических объектах, таких как звёзды, галактики, экзопланеты и т. д. Физические свойства материи в самых больших масштабах и возникновение Вселенной изучает космология.")=="Астрофизика"?alert("Верно"):alert("Неверно")
}
function question13() {
    let quest = prompt("Транзисторы с двумя физическими p-n-переходами, ток Коллектор-Эмиттер которого управляется током База-Эмиттер.")=="Биполярные транзисторы"?alert("Верно"):alert("Неверно")
}
function question14() {
    let quest = prompt("Раздел астрофизики, который состоит из приложения спектрального анализа к изучению небесных тел.")=="Астроспектроскопия"?alert("Верно"):alert("Неверно")
}
function question15() {
    let quest = prompt("Транзистор, ток Исток-Сток которого управляется Напряжением на p-n- или n-p-переходе Затвор-Сток или потенциалом на нём в транзисторах без физического перехода — с затвором, гальванически изолированным от канала Сток-Исток.")=="Полевой транзистор"?alert("Верно"):alert("Неверно")
}
function question20() {
    let quest = prompt("Изучает излучения в диапазоне длин волн от 0.1 мм до 0 м. Радиоволны испускаются, например: такими холодными объектами как межзвёздный газ и пылевые облака; Реликтовым излучением, являющимся отголоском Большого Взрыва; Пульсарами, впервые обнаруженными в микроволновом диапазоне; Далёкими радиогалактиками и квазарами. Для наблюдений в радиодиапазоне требуются телескопы очень больших размеров. Зачастую наблюдения проводятся с использованием интерферометров и сетей РСДБ.")=="Радиоастрономия"?alert("Верно"):alert("Неверно")
}
function question21() {
    let quest = prompt("Умножитель напряжения на")=="Выпрямительном диоде"?alert("Верно"):alert("Неверно")
}
function question22() {
    let quest = prompt("Изучает излучение на волнах, находящихся в промежутке между радиоизлучением и видимым светом. Наблюдения в этой области спектра обычно производятся на телескопах, подобных обычным оптическим телескопам. Наблюдаемые объекты обычно холоднее звёзд: планеты, межзвёздная пыль.")=="Инфракрасная астрономия"?alert("Верно"):alert("Неверно")
}
function question23() {
    let quest = prompt("Умножитель частоты на")=="Нелинейном диоде"?alert("Верно"):alert("Неверно")
}
function question24() {
    let quest = prompt("Является старейшей областью астрофизики. На сегодняшний день основными инструментами являются телескопы с ПЗС-матрицами в качестве приёмников изображения. Так же часто производятся наблюдения с помощью спектрографов. Ограничение на наблюдения в оптическом диапазоне накладывает дрожание земной атмосферы, мешающее наблюдениям на больших телескопах. Для устранения этого эффекта и получения максимально чёткого изображения используются различные методы, такие как адаптивная оптика, спекл-интерферометрия, а также выведение телескопов в космическое пространство за пределы атмосферы. В этом диапазоне хорошо видны звёзды и планетарные туманности, что позволяет изучать в том числе их расположение и химическое строение.")=="Оптическая астрономия"?alert("Верно"):alert("Неверно")
}
function question25() {
    let quest = prompt("Ультрафиолетовая астрономия, рентгеновская астрономия и гамма-астрономия(астрофизика) изучают")=="Объекты"?alert("Верно"):alert("Неверно")
}
function question30() {
    let quest = prompt("Изучению Солнца отводится")=="Отдельное место"?alert("Верно"):alert("Неверно")
}
function question31() {
    let quest = prompt("Использует как аналитические методы, так и численное моделирование для изучения различных астрофизических явлений")=="Теоретическая астрофизика"?alert("Верно"):alert("Неверно")
}
function question32() {
    let quest = prompt("Их моделей и теорий")=="Построения"?alert("Верно"):alert("Неверно")
}
function question33() {
    let quest = prompt("Подобные модели, построенные из анализ")=="наблюдательных данных"?alert("Верно"):alert("Неверно")
}
function question34() {
    let quest = prompt("Могут быть проверены с помощью сравнения теоретических предсказаний и")=="Вновь полученных данных"?alert("Верно"):alert("Неверно")
}
function question35() {
    let quest = prompt("Наблюдения также могут различаться по")=="Продолжительности"?alert("Верно"):alert("Неверно")
}
function question40() {
    let quest = prompt("Другие типы излучения также могут наблюдаться с")=="Земли"?alert("Верно"):alert("Неверно")
}
/*https://www.youtube.com/watch?v=D3f-joHRQ-Y*/